#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	текСтрока = Элементы.Товары.ТекущиеДанные;
	ПересчитатьСумму(текСтрока);
КонецПроцедуры


&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	текСтрока = Элементы.Товары.ТекущиеДанные;
	ПересчитатьСумму(текСтрока);	
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
 
 	&НаКлиенте
	Процедура ПересчитатьСумму(текСтрока)
		
		Если текСтрока = Неопределено Тогда
			текСтрока.Сумма = 0;
			Возврат;
		КонецЕсли;
		
		текСтрока.Сумма = текСтрока.Цена * текСтрока.Количество;
		
	КонецПроцедуры

#КонецОбласти
